

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЗачисленияИВыпуск Приход
	Движения.ЗачисленияИВыпуск.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_Дети Из ТЧ_Дети Цикл
		Движение = Движения.ЗачисленияИВыпуск.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Воспитанник = ТекСтрокаТЧ_Дети.Ребенок;
		Движение.Группа = Группа;
		Движение.Дата = ДатаЗачисления;
		Движение.ФактПрисутствия = 1;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

