
&НаКлиенте
Процедура ОтборЦенаЗначениеПриИзменении(Элемент)
	УстановитьОтборПоЦене();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоЦене()
	
	Список.Отбор.Элементы.Очистить();
	
	ЭлементОтбораЦена=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораЦена.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Цена");
	ЭлементОтбораЦена.ВидСравнения= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораЦена.ПравоеЗначение=ЭтаФорма.ОтборЦенаЗначение;
	
	Если ЭтаФорма.ОтборЦенаФлаг Тогда
		ЭлементОтбораЦена.Использование=Истина;
	Иначе
		ЭлементОтбораЦена.Использование=Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтборЦенаФлагПриИзменении(Элемент)
	ЭтаФорма.ОтборДатаФлаг=Ложь;
	УстановитьОтборПоЦене();
КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаЗначениеПриИзменении(Элемент)
	УстановитьОтборПоДате();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоДате()
	
	Список.Отбор.Элементы.Очистить();
	
	ЭлементОтбораДата=Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДата.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Период");
	ЭлементОтбораДата.ВидСравнения= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораДата.ПравоеЗначение=ЭтаФорма.ОтборДатаЗначение;
	
	Если ЭтаФорма.ОтборДатаФлаг Тогда
		ЭлементОтбораДата.Использование=Истина;
	Иначе
		ЭлементОтбораДата.Использование=Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаФлагПриИзменении(Элемент)
	ЭтаФорма.ОтборЦенаЗначение=Ложь;
	УстановитьОтборПоДате();
КонецПроцедуры
