
&НаСервере
Процедура КомандаСформироватьНаСервере()
	// Запретим обновление диаграммы
	ДиаграммаГанта.Очистить();
	ДиаграммаГанта.Обновление = Ложь;
	
	//Заправляем данные для заполнения диаграммы
	Запрос = Новый Запрос (
	"ВЫБРАТЬ
	|	НачисленияФактическийПериодДействия.Сотрудник,
	|	НачисленияФактическийПериодДействия.ВидРасчета,
	|	НачисленияФактическийПериодДействия.ПериодДействияНачало,
	|	НачисленияФактическийПериодДействия.ПериодДействияКонец,
	|	НачисленияФактическийПериодДействия.Результат,
	|	НачисленияФактическийПериодДействия.Регистратор,
	|	НачисленияФактическийПериодДействия.Регистратор.Представление
	|ИЗ
	|	РегистрРасчета.Начисления.ФактическийПериодДействия КАК НачисленияФактическийПериодДействия");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	//заполнить диаграмму
	Пока Выборка.Следующий()Цикл
		
		//Получаем серию, точку и значение для них
		Точка = ДиаграммаГанта.УстановитьТочку(Выборка.Сотрудник);
		Серия = ДиаграммаГанта.УстановитьСерию(Выборка.ВидРасчета);
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		
		//Создаем нужные интервалы и значения
		Интервал = Значение.Добавить();
		Интервал.Начало = Выборка.ПериодДействияНачало;
		Интервал.Конец = Выборка.ПериодДействияКонец;
		Интервал.Текст = Выборка.РегистраторПредставление;
		Интервал.Расшифровка = Выборка.Регистратор;
	КонецЦикла;
	
	//Раскрасим серии своими цветами
	Для Каждого Серия Из ДиаграммаГанта.Серии Цикл
		Если Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Оклад Тогда
			Серия.Цвет = WEBЦвета.ЗеленаяЛужайка;
		ИначеЕсли Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Невыход Тогда
			Серия.Цвет = WEBЦвета.Черный;
			ИначеЕсли Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Премия Тогда
			Серия.Цвет = WEBЦвета.Индиго;
						ИначеЕсли Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Больничный Тогда
			Серия.Цвет = WEBЦвета.МятныйКрем;
		КонецЕсли;   
	КонецЦикла;
	
	//разрешить обновление диаграммы
	ДиаграммаГанта.Обновление = Истина;

КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать(Команда)
	КомандаСформироватьНаСервере();
КонецПроцедуры


