
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолеВыбораТипаДиаграммы = ТипДиаграммы.Гистограмма;
	Диаграмма.ТипДиаграммы=ПолеВыбораТипаДиаграммы;
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыбораТипаДиаграмммыПриИзменении(Элемент)
	Диаграмма.ТипДиаграммы=ПолеВыбораТипаДиаграммы;
КонецПроцедуры

&НаСервере
Процедура КомандаСформироватьДиаграммуНаСервере()
	ЗапросДанных=Новый Запрос;
	ЗапросДанных.Текст=
	"ВЫБРАТЬ
	|	ЦеныОплатыЗаДетскийСад.Период КАК Период,
	|	ЦеныОплатыЗаДетскийСад.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныОплатыЗаДетскийСад КАК ЦеныОплатыЗаДетскийСад
	|
	|УПОРЯДОЧИТЬ ПО
	|	Цена УБЫВ";
	
	ВыборкаДанных=ЗапросДанных.Выполнить().Выбрать();
	
	Диаграмма.Обновление=Ложь;
	Диаграмма.АвтоТранспонирование=Ложь;
	
	ТочкаДиаграммы=Диаграмма.УстановитьТочку("Цена");
	
	Пока ВыборкаДанных.Следующий()Цикл
		ТекущаяСерияДиаграммы=Диаграмма.УстановитьСерию(ВыборкаДанных.Период);
		Диаграмма.УстановитьЗначение(ТочкаДиаграммы, ТекущаяСерияДиаграммы, ВыборкаДанных.Цена);
	КонецЦикла;
	
	Диаграмма.Обновление=Истина;
	Диаграмма.АвтоТранспонирование=Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьДиаграмму(Команда)
	КомандаСформироватьДиаграммуНаСервере();
КонецПроцедуры
