

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЗачисленияИВыпуск Расход
	Движения.ЗачисленияИВыпуск.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_Дети Из ТЧ_Дети Цикл
		Движение = Движения.ЗачисленияИВыпуск.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Воспитанник = Воспитанник;
		Движение.Группа = Группа;
		Движение.Дата = ДатаВыпуска;
		Движение.ФактПрисутствия = 0;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

