
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПоступлениеОплаты Приход
	Движения.ПоступлениеОплаты.Записывать = Истина;
	Движение = Движения.ПоступлениеОплаты.Добавить();
	Движение.Период = Дата;
	Движение.Плательщик = Плательщик;
	Движение.Воспитанник = Воспитанник;
	Движение.Сумма = СуммаПоступления;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
