
&НаКлиенте
Процедура КомандаСформироватьОтчет(Команда)
	Отчет();
КонецПроцедуры   

&НаСервере
Процедура Отчет()
 ТабДок=ТабличныйДокумент;
 ТабДок.Очистить();
 ТабДок.ТолькоПросмотр=Истина;
 
 Макет=ПолучитьМакетНаСервере("Макет");
 
 ОбластьЗаголовок=Макет.ПолучитьОбласть("ОбластьЗаголовок");
 ТабДок.Вывести(ОбластьЗаголовок);
 
 ОбластьШапка=Макет.ПолучитьОбласть("ОбластьШапка");
 ТабДок.Вывести(ОбластьШапка);
 
 ОбластьГруппа=Макет.ПолучитьОбласть("ОбластьГруппа");
 ОбластьПериод=Макет.ПолучитьОбласть("ОбластьПериод");
 ОбластьДанные=Макет.ПолучитьОбласть("ОбластьДанные");
 
 ЗапросДанных=Новый Запрос;
 ЗапросДанных.Текст= 
 
 "ВЫБРАТЬ
 |	ЗачисленияИВыпускОстаткиИОбороты.Воспитанник КАК Воспитанник,
 |	ЗачисленияИВыпускОстаткиИОбороты.Группа КАК Группа,
 |	ЗачисленияИВыпускОстаткиИОбороты.Дата КАК Период
 |ИЗ
 |	РегистрНакопления.ЗачисленияИВыпуск.ОстаткиИОбороты КАК ЗачисленияИВыпускОстаткиИОбороты
 |
 |УПОРЯДОЧИТЬ ПО
 |	Воспитанник,
 |	Группа,
 |	Период
 |ИТОГИ ПО
 |	Воспитанник,
 |	Группа,
 |	Период";
  
 ВыборкаГруппа=ЗапросДанных.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Группа");
 
 ТабДок.НачатьАвтогруппировкуСтрок();
 
 Пока  ВыборкаГруппа.Следующий()Цикл
	 ОбластьГруппа.Параметры.Группа=ВыборкаГруппа.Группа;
	 ТабДок.Вывести(ОбластьГруппа, ВыборкаГруппа.Уровень(),,Ложь);
	 
	 ВыборкаПериод=ВыборкаГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период");
	 Пока ВыборкаПериод.Следующий() Цикл
		 ОбластьПериод.Параметры.Период=ВыборкаПериод.Период;
		 ТабДок.Вывести(ОбластьПериод, ВыборкаПериод.Уровень(),,Ложь);
		 
	     ВыборкаДанных=ВыборкаПериод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Воспитанник");
		 Пока ВыборкаДанных.Следующий()Цикл
			 ОбластьДанные.Параметры.Период=ВыборкаДанных.Период;
			 ОбластьДанные.Параметры.Воспитанник=ВыборкаДанных.Воспитанник;
			 ТабДок.Вывести(ОбластьДанные, ВыборкаДанных.Уровень(),,Ложь);
		 КонецЦикла;
	 КонецЦикла;
 КонецЦикла;
 ТабДок.ЗакончитьАвтогруппировкуСтрок();
  
 ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
 ТабДок.МасштабПечати=100;
 
 ТабДок.РазмерСтраницы="A4";
 ТабДок.ТочностьПечати=ТочностьПечати.Точная;
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНаСервере (ИмяМакета)
	
	ЭО=РеквизитФормыВЗначение("Отчет");
	Макет=ЭО.ПолучитьМакет(ИмяМакета);
	Возврат Макет;
	
КонецФункции
